0.orig/cold_fluid/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "../../system/include/caseSettings"

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $T_cold;

boundaryField
{
    inlet_cold
    {
        type            fixedValue;
        value           uniform $T_cold;
    }

    outlet_cold
    {
        type            inletOutlet;
        inletValue      uniform $T_cold;
        value           uniform $T_cold;
    }

    "solid.*"
    {
        type            zeroGradient;
    }

    ".*_to_.*"
    {
        #include        "../include/thermalShellCoupled"
    }

    ".*"
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
