0.orig/cold_fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "../../system/include/caseSettings"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet_cold
    {
        type            flowRateInletVelocity;
        massFlowRate    constant $mdotCold;
        rhoInlet        $rhoInlet;
        value           uniform (0 0 0);
    }

    outlet_cold
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }

    "solid.*"
    {
        type            noSlip;
    }

    ".*_to_.*"
    {
        type            noSlip;
    }

    ".*"
    {
        type            noSlip;
    }
}

// ************************************************************************* //
