0.orig/cold_fluid/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet_cold
    {
        type            calculated;
        value           uniform 0;
    }

    outlet_cold
    {
        type            calculated;
        value           uniform 0;
    }

    "solid.*"
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    ".*_to_.*"
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    ".*"
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
}

// ************************************************************************* //
