0.orig/cold_fluid/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "../../system/include/caseSettings"

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform $pRef;

boundaryField
{
    ".*"
    {
        type            calculated;
        value           $internalField;
    }
}

// ************************************************************************* //
