0.orig/hot_fluid/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "../../system/include/caseSettings"

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform $pRef;

boundaryField
{
    inlet_hot
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    outlet_hot
    {
        type            fixedValue;
        value           $internalField;
    }

    "solid.*"
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    ".*_to_.*"
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    ".*"
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
}

// ************************************************************************* //
