system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-0.05 -0.30 -0.35)
    ( 2.45 -0.30 -0.35)
    ( 2.45  0.30 -0.35)
    (-0.05  0.30 -0.35)
    (-0.05 -0.30  0.35)
    ( 2.45 -0.30  0.35)
    ( 2.45  0.30  0.35)
    (-0.05  0.30  0.35)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 40 50) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    defaultFaces
    {
        type patch;
        faces
        (
            (1 5 4 0)
            (3 7 6 2)
            (0 4 7 3)
            (2 6 5 1)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
